HW8/blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "image", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "fturftu"], ["title", "futf"], ["image", "fuf"], ["created_at", "2022-01-08 17:22:30.665959"], ["updated_at", "2022-01-08 17:22:30.665959"], ["author_id", "1"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image" = $1, "updated_at" = $2, "author_id" = $3 WHERE "posts"."id" = $4  [["image", "2"], ["updated_at", "2022-01-09 19:12:09.337950"], ["author_id", 3], ["id", 24]]